saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Atmel.SAM3U_DFP.1.0.49.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         xmlns:saxon="http://saxon.sf.net//"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Atmel</vendor>
   <url>http://packs.download.atmel.com/</url>
   <name>SAM3U_DFP</name>
   <description>Atmel SAM3U Series Device Support</description>
   <releases>
      <release version="1.0.49" date="2016-09-15">Fix max speed in ATDF files.</release>
      <release version="1.0.34">Updated documentation links.</release>
      <release version="1.0.32">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Atmel</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Atmel</keyword>
      <keyword>SAM3U</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAM3U" Dvendor="Atmel:3">
         <device Dname="ATSAM3U4E">
            <processor Dcore="Cortex-M3"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/sam.h" define="__SAM3U4E__"/>
            <debug svd="svd/ATSAM3U4E.svd"/>
            <memory id="IROM1"
                    start="0x00080000"
                    size="0x00020000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00100000" size="0x00020000"/>
            <memory id="IROM3" start="0x00180000" size="0x00100000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00008000" default="1"/>
            <memory id="IRAM2" start="0x20080000" size="0x00004000"/>
            <algorithm name="keil/Flash/ATSAM3U_128.FLM"
                       start="0x00080000"
                       size="0x00020000"
                       default="1"/>
            <algorithm name="keil/Flash/ATSAM3U_128_B1.FLM"
                       start="0x00100000"
                       size="0x00020000"
                       default="1"/>
            <algorithm name="keil/Flash/ATSAM3U_GPNVM.FLM"
                       start="0x1FFFFFF0"
                       size="0x00000010"
                       default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATSAM3U4E.atdf"/>
                  <at:variant ordercode="ATSAM3U4E-CU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATSAM3U4E-AU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="IFLASH0"
                             start="0x00080000"
                             size="0x00020000"
                             type="flash"
                             pagesize="256"
                             mirror-mask="0x60000"
                             address-space="base"/>
                  <at:memory name="IFLASH1"
                             start="0x00100000"
                             size="0x00020000"
                             type="flash"
                             pagesize="256"
                             mirror-mask="0x60000"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00180000"
                             size="0x00100000"
                             type="rom"
                             address-space="base"/>
                  <at:memory name="IRAM0"
                             start="0x20000000"
                             size="0x00008000"
                             type="ram"
                             mirror-mask="0x78000"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00004000"
                             type="ram"
                             mirror-mask="0x7C000"
                             address-space="base"/>
                  <at:memory name="NFC_RAM"
                             start="0x20100000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="UDPHS_RAM"
                             start="0x20180000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <description>Cortex-M3 Microcontroller with 256KB Flash, HS USB, 144 Pins</description>
            <book name="http://www.atmel.com/Images/6430s.pdf"
                  title="Datasheet (Summary)"/>
            <book name="http://www.atmel.com/devices/ATSAM3U4E.aspx" title="Device Page"/>
         </device>
         <device Dname="ATSAM3U4C">
            <processor Dcore="Cortex-M3"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/sam.h" define="__SAM3U4C__"/>
            <debug svd="svd/ATSAM3U4C.svd"/>
            <memory id="IROM1"
                    start="0x00080000"
                    size="0x00020000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00100000" size="0x00020000"/>
            <memory id="IROM3" start="0x00180000" size="0x00100000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00008000" default="1"/>
            <memory id="IRAM2" start="0x20080000" size="0x00004000"/>
            <algorithm name="keil/Flash/ATSAM3U_128.FLM"
                       start="0x00080000"
                       size="0x00020000"
                       default="1"/>
            <algorithm name="keil/Flash/ATSAM3U_128_B1.FLM"
                       start="0x00100000"
                       size="0x00020000"
                       default="1"/>
            <algorithm name="keil/Flash/ATSAM3U_GPNVM.FLM"
                       start="0x1FFFFFF0"
                       size="0x00000010"
                       default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATSAM3U4C.atdf"/>
                  <at:variant ordercode="ATSAM3U4C-CU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATSAM3U4C-AU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="IFLASH0"
                             start="0x00080000"
                             size="0x00020000"
                             type="flash"
                             pagesize="256"
                             mirror-mask="0x60000"
                             address-space="base"/>
                  <at:memory name="IFLASH1"
                             start="0x00100000"
                             size="0x00020000"
                             type="flash"
                             pagesize="256"
                             mirror-mask="0x60000"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00180000"
                             size="0x00100000"
                             type="rom"
                             address-space="base"/>
                  <at:memory name="IRAM0"
                             start="0x20000000"
                             size="0x00008000"
                             type="ram"
                             mirror-mask="0x78000"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00004000"
                             type="ram"
                             mirror-mask="0x7C000"
                             address-space="base"/>
                  <at:memory name="NFC_RAM"
                             start="0x20100000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="UDPHS_RAM"
                             start="0x20180000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <description>Cortex-M3 Microcontroller with 256KB Flash, HS USB, 100 Pins</description>
            <book name="http://www.atmel.com/Images/6430s.pdf"
                  title="Datasheet (Summary)"/>
            <book name="http://www.atmel.com/devices/ATSAM3U4C.aspx" title="Device Page"/>
         </device>
         <device Dname="ATSAM3U1C">
            <processor Dcore="Cortex-M3"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/sam.h" define="__SAM3U1C__"/>
            <debug svd="svd/ATSAM3U1C.svd"/>
            <memory id="IROM1"
                    start="0x00080000"
                    size="0x00010000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00180000" size="0x00100000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00002000" default="1"/>
            <memory id="IRAM2" start="0x20080000" size="0x00002000"/>
            <algorithm name="keil/Flash/ATSAM3U_64.FLM"
                       start="0x00080000"
                       size="0x00010000"
                       default="1"/>
            <algorithm name="keil/Flash/ATSAM3U_GPNVM.FLM"
                       start="0x1FFFFFF0"
                       size="0x00000010"
                       default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATSAM3U1C.atdf"/>
                  <at:variant ordercode="ATSAM3U1C-CU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATSAM3U1C-AU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="IFLASH0"
                             start="0x00080000"
                             size="0x00010000"
                             type="flash"
                             pagesize="256"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00180000"
                             size="0x00100000"
                             type="rom"
                             address-space="base"/>
                  <at:memory name="IRAM0"
                             start="0x20000000"
                             size="0x00002000"
                             type="ram"
                             mirror-mask="0x7E000"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00002000"
                             type="ram"
                             mirror-mask="0x7E000"
                             address-space="base"/>
                  <at:memory name="NFC_RAM"
                             start="0x20100000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="UDPHS_RAM"
                             start="0x20180000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x01000000"
                             type="other"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <description>Cortex-M3 Microcontroller with 64KB Flash, HS USB, 100 Pins</description>
            <book name="http://www.atmel.com/Images/6430s.pdf"
                  title="Datasheet (Summary)"/>
            <book name="http://www.atmel.com/devices/ATSAM3U1C.aspx" title="Device Page"/>
         </device>
